#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
  
```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.fiap_burger_eks: Reading...
data.terraform_remote_state.fiap_burger_identity: Reading...
data.terraform_remote_state.fiap_burger_identity: Read complete after 0s
data.terraform_remote_state.fiap_burger_eks: Read complete after 0s
aws_apigatewayv2_api.fiap_burger: Refreshing state... [id=w8x793xbk4]
aws_security_group.vpc_link: Refreshing state... [id=sg-0e765af23b9b6bab6]
aws_lambda_permission.api_gtw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_integration.fiap_burger_identity_integration: Refreshing state... [id=h85ijxe]
aws_apigatewayv2_stage.dev: Refreshing state... [id=dev]
aws_apigatewayv2_vpc_link.fiap_burger_eks: Refreshing state... [id=ptwllw]
aws_apigatewayv2_route.proxy_handler: Refreshing state... [id=gnuighg]
aws_apigatewayv2_integration.fiap_burger_eks: Refreshing state... [id=gg5vjw2]
aws_apigatewayv2_route.proxy: Refreshing state... [id=m1wzd55]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_apigatewayv2_api.fiap_burger has been deleted
  - resource "aws_apigatewayv2_api" "fiap_burger" {
      - execution_arn                = "arn:aws:execute-api:us-east-1:287574492696:w8x793xbk4" -> null
      - id                           = "w8x793xbk4" -> null
        name                         = "fiap_burger"
        tags                         = {}
        # (9 unchanged attributes hidden)
    }

  # aws_apigatewayv2_integration.fiap_burger_eks has been deleted
  - resource "aws_apigatewayv2_integration" "fiap_burger_eks" {
      - id                                        = "gg5vjw2" -> null
        # (17 unchanged attributes hidden)
    }

  # aws_apigatewayv2_integration.fiap_burger_identity_integration has been deleted
  - resource "aws_apigatewayv2_integration" "fiap_burger_identity_integration" {
      - id                                        = "h85ijxe" -> null
        # (17 unchanged attributes hidden)
    }

  # aws_apigatewayv2_stage.dev has been deleted
  - resource "aws_apigatewayv2_stage" "dev" {
        id                    = "dev"
      - invoke_url            = "https://w8x793xbk4.execute-api.us-east-1.amazonaws.com/dev" -> null
        name                  = "dev"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_apigatewayv2_vpc_link.fiap_burger_eks has been deleted
  - resource "aws_apigatewayv2_vpc_link" "fiap_burger_eks" {
      - id                 = "ptwllw" -> null
        name               = "fiap-burger-eks"
        tags               = {}
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.vpc_link has been deleted
  - resource "aws_security_group" "vpc_link" {
      - id                     = "sg-0e765af23b9b6bab6" -> null
        name                   = "fiap-burger-k8s-vpc-link"
        tags                   = {}
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_apigatewayv2_api.fiap_burger will be created
  + resource "aws_apigatewayv2_api" "fiap_burger" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "fiap_burger"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # aws_apigatewayv2_integration.fiap_burger_eks will be created
  + resource "aws_apigatewayv2_integration" "fiap_burger_eks" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:us-east-1:287574492696:listener/net/a7abb96d2725348168f868bf2f3e88de/b8c3e8b49b51907b/161300bdad16df61"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.fiap_burger_identity_integration will be created
  + resource "aws_apigatewayv2_integration" "fiap_burger_identity_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:287574492696:function:fiap_burger_identity/invocations"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.proxy will be created
  + resource "aws_apigatewayv2_route" "proxy" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /fiap-burger/{proxy+}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.proxy_handler will be created
  + resource "aws_apigatewayv2_route" "proxy_handler" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /identity"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.dev will be created
  + resource "aws_apigatewayv2_stage" "dev" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "dev"
      + tags_all      = (known after apply)
    }

  # aws_apigatewayv2_vpc_link.fiap_burger_eks will be created
  + resource "aws_apigatewayv2_vpc_link" "fiap_burger_eks" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "fiap-burger-eks"
      + security_group_ids = (known after apply)
      + subnet_ids         = [
          + "subnet-00d8aa6ee422c7435",
          + "subnet-0fb6bf5001ba54ea2",
        ]
      + tags_all           = (known after apply)
    }

  # aws_lambda_permission.api_gtw must be replaced
-/+ resource "aws_lambda_permission" "api_gtw" {
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      ~ source_arn          = "arn:aws:execute-api:us-east-1:287574492696:w8x793xbk4/*/*/identity" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.vpc_link will be created
  + resource "aws_security_group" "vpc_link" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "fiap-burger-k8s-vpc-link"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0defc1861d54d84b4"
    }

Plan: 9 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ apigateway_execution_arn = (sensitive value)
  ~ apigateway_id            = (sensitive value)
  ~ apigateway_url           = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
  
</details>

*Pusher: @gm50x*
*Action: `pull_request`*
*Workflow: `Terraform IAC - API Gateway`*